reviewing hover to show tooltip on edge
